var canvas = document.getElementById('canvas');
var c = canvas.getContext('2d');

var zacetek = document.getElementById('box');
var pathIndex = 0;
var x = zacetek.offsetLeft;
var y = zacetek.offsetTop;
var speed = 2;
var path = [
    {x: 615, y:125},  // začetek (.pika-bg)
    {x: 655, y:170},
    {x: 667, y:165},
    {x: 677, y:172},
    {x: 690, y:167},
	{x: 697, y:175},
    {x: 690, y:190},
    {x: 707, y:209},
    {x: 719, y:204},
    {x: 730, y:210},
	{x: 740, y:205}, 
    {x: 750, y:215},
    {x: 737, y:245},
    {x: 750, y:240},
    {x: 770, y:260},
	{x: 782, y:250},
    {x: 765, y:230},
    {x: 773, y:217},
    {x: 767, y:205},
    {x: 775, y:198},
	{x: 795, y:218},  
    {x: 785, y:230},
    {x: 795, y:240},
    {x: 820, y:225},
    {x: 840, y:245},
	{x: 850, y:235},
    {x: 843, y:225},
    {x: 864, y:205},
    {x: 885, y:228},
    {x: 874, y:237},
	{x: 893, y:263}, 
    {x: 918, y:245},
    {x: 928, y:253},
    {x: 940, y:245},
    {x: 930, y:232},
	{x: 940, y:223},
    {x: 933, y:207},
    {x: 970, y:182},
    {x: 988, y:203},
    {x: 1000, y:194},
	{x: 1020, y:215}, 
    {x: 1033, y:208},
    {x: 1025, y:196},
    {x: 1033, y:186},
    {x: 1017, y:163},
	{x: 1027, y:153},
    {x: 1047, y:175},
    {x: 1061, y:166},
    {x: 1068, y:177},
    {x: 1047, y:198},
	{x: 1053, y:210}, 
    {x: 1033, y:230},
    {x: 1040, y:242},
    {x: 1007, y:273},
    {x: 1024, y:296},
	{x: 1037, y:288},
    {x: 1047, y:298},
    {x: 1059, y:290},
    {x: 1068, y:300},
    {x: 1059, y:311},
	{x: 1067, y:321},  
    {x: 1057, y:333},
    {x: 1065, y:345},
    {x: 1053, y:355},
    {x: 1043, y:345},
	{x: 1020, y:364},
    {x: 1058, y:412},
    {x: 1023, y:442},
    {x: 1013, y:432},
    {x: 1000, y:440},
	{x: 990, y:430}, 
    {x: 968, y:447},
    {x: 975, y:460},
    {x: 965, y:470},
    {x: 973, y:482},
	{x: 962, y:492},
    {x: 928, y:500},
    {x: 918, y:490},
    {x: 906, y:497},
    {x: 923, y:520},
	{x: 890, y:553},  
    {x: 907, y:576},
    {x: 896, y:586},
    {x: 887, y:576},
    {x: 875, y:586},
	{x: 865, y:576},
    {x: 855, y:585},
    {x: 870, y:605},
    {x: 884, y:598},
    {x: 894, y:608},
	{x: 918, y:590}, 
    {x: 928, y:600},
    {x: 918, y:615},
    {x: 928, y:623},
    {x: 948, y:608},
	{x: 958, y:615},
    {x: 970, y:608},
    {x: 980, y:618},
    {x: 970, y:628},
    {x: 1000, y:663},
	{x: 955, y:705}, 
    {x: 980, y:740},
    {x: 995, y:733},
    {x: 1005, y:743},
    {x: 995, y:753},
	{x: 1003, y:765},
    {x: 993, y:775},
    {x: 980, y:765},
    {x: 930, y:800},
    {x: 950, y:825},
	{x: 940, y:840}, 
    {x: 950, y:850},
    {x: 940, y:860},
    {x: 950, y:870},
    {x: 985, y:845},
	{x: 995, y:855},
    {x: 985, y:865},
    {x: 1015, y:900},
    {x: 1025, y:890},
    {x: 1015, y:880},
	{x: 1035, y:860},  
    {x: 1030, y:845},
    {x: 1050, y:825},
    {x: 1045, y:815},
    {x: 1055, y:805},
	{x: 1065, y:815},
    {x: 1085, y:798},
    {x: 1060, y:760},
    {x: 1045, y:765},
    {x: 1010, y:725},
	{x: 1016, y:710}, 
    {x: 1010, y:700},
    {x: 1030, y:680},
    {x: 1025, y:670},
    {x: 1035, y:657},
	{x: 1015, y:637},
    {x: 1003, y:643},
    {x: 993, y:633},
    {x: 1005, y:620},
    {x: 965, y:573},
	{x: 940, y:590},  
    {x: 930, y:580},
    {x: 940, y:570},
    {x: 935, y:555},
    {x: 958, y:538},
	{x: 938, y:514},
    {x: 948, y:504},
    {x: 968, y:524},
    {x: 980, y:520},
    {x: 990, y:530},
	{x: 1005, y:522}, 
    {x: 1033, y:555},
    {x: 1008, y:573},
    {x: 1000, y:563},
    {x: 990, y:573},
	{x: 1003, y:593}
];

function drawIt() {
    c.clearRect(0,0,canvas.width,canvas.height);

    // nariši pravokotnik
    c.fillStyle = "red";
    c.fillRect(x, y, 10, 10);

    if(pathIndex < path.length){
        // ciljna točka
        var target = path[pathIndex];

        // izračunaj smer
        var dx = target.x - x;
        var dy = target.y - y;

        // izračunaj dolžino vektorja
        var dist = Math.sqrt(dx*dx + dy*dy);

        if(dist < speed){
            // dosežena točka, pojdi na naslednjo
            x = target.x;
            y = target.y;
            pathIndex++;
        } else {
            // premakni se proti točki proporcionalno
            x += dx/dist * speed;
            y += dy/dist * speed;
        }
    }
}

function animate() {
    drawIt();
    requestAnimationFrame(animate);
}

animate();